#cobol code for even numbers
IDENTIFICATION DIVISION.
PROGRAM-ID. EVENNUMBERS.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUMBERS.
   02 NUM PIC 9(2) OCCURS 10 TIMES.
01 I PIC 9(2) VALUE 1.   *> Loop counter
01 B PIC 9(1).           *> Store remainder

PROCEDURE DIVISION.
ACCEPT-NUMBERS.
    DISPLAY "Enter 10 numbers: "
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
        ACCEPT NUM(I)
    END-PERFORM.

DISPLAY-EVEN-NUMBERS.
    DISPLAY "Even Numbers: "
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
        DIVIDE NUM(I) BY 2 GIVING B REMAINDER B
        IF B = 0 THEN
            DISPLAY NUM(I)
        END-IF
    END-PERFORM.

    STOP RUN.
